Revit 2027 API
BendingDetailCustomFieldProperties.SegmentLengthDimensionTextPosition Property
 Identifies the text position with respect to dimension line.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailDimensionTextPosition SegmentLengthDimensionTextPosition { get; set; }
Public Property SegmentLengthDimensionTextPosition As BendingDetailDimensionTextPosition
	Get
	Set
public:
property BendingDetailDimensionTextPosition SegmentLengthDimensionTextPosition {
	BendingDetailDimensionTextPosition get ();
	void set (BendingDetailDimensionTextPosition value);
}
member SegmentLengthDimensionTextPosition : BendingDetailDimensionTextPosition with get, set
Property Value
BendingDetailDimensionTextPosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace